---
title: AnnotationMultipleAlignmentUtils
classe: Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# AnnotationMultipleAlignmentUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `annotationMultipleAlignmentUtils.IsValidObject` | Boolean |
| `Void Dispose()` | `annotationMultipleAlignmentUtils.Dispose()` | Void |
| `Boolean ElementSupportsMultiAlign(Element)` | `AnnotationMultipleAlignmentUtils.ElementSupportsMultiAlign(element)` | Boolean |
| `IList<XYZ> GetAnnotationOutlineWithoutLeaders(Element)` | `AnnotationMultipleAlignmentUtils.GetAnnotationOutlineWithoutLeaders(element)` | IList<XYZ> |
| `Void MoveWithAnchoredLeaders(Element, XYZ)` | `AnnotationMultipleAlignmentUtils.MoveWithAnchoredLeaders(element, moveVec)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```